AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfo0.h
// NV_PWR_RESET_CFG - MRAM recovery NV device power and reset types, polarity and timing configurations
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_JEDEC_RESET_S 30
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_JEDEC_RESET_M 0x40000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_JEDEC_RESET(n) (((uint32_t)(n) << 30) & 0x40000000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_JEDEC_RESET_Pos 30
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_JEDEC_RESET_Msk 0x40000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_POL_S 29
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_POL_M 0x20000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_POL(n) (((uint32_t)(n) << 29) & 0x20000000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_POL_Pos 29
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_POL_Msk 0x20000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_UNITS_S 28
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_UNITS_M 0x10000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_UNITS(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_UNITS_Pos 28
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_UNITS_Msk 0x10000000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_S 16
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_M 0x0FFF0000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY(n) (((uint32_t)(n) << 16) & 0x0FFF0000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_Pos 16
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_RESET_DLY_Msk 0x0FFF0000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_POL_S 13
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_POL_M 0x00002000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_POL(n) (((uint32_t)(n) << 13) & 0x00002000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_POL_Pos 13
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_POL_Msk 0x00002000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_UNITS_S 12
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_UNITS_M 0x00001000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_UNITS(n) (((uint32_t)(n) << 12) & 0x00001000)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_UNITS_Pos 12
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_UNITS_Msk 0x00001000
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_S 0
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_M 0x00000FFF
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY(n) (((uint32_t)(n) << 0) & 0x00000FFF)
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_Pos 0
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_PWR_DLY_Msk 0x00000FFF

// NV_PIN_NUMS - MRAM recovery NV device pin numbers Power, Reset and CE pins. The CE pin number is applicable to MSPI type only.  Pin numbers for the Data pins, SCLK and DQS (MSPI) and CMD (EMMC) are predetermined and set based on the device type (MSPI/EMMC) and the module number.
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_CE_PIN_S 16
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_CE_PIN_M 0x00FF0000
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_CE_PIN(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_CE_PIN_Pos 16
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_CE_PIN_Msk 0x00FF0000
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_RESET_PIN_S 8
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_RESET_PIN_M 0x0000FF00
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_RESET_PIN(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_RESET_PIN_Pos 8
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_RESET_PIN_Msk 0x0000FF00
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_PWR_PIN_S 0
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_PWR_PIN_M 0x000000FF
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_PWR_PIN(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_PWR_PIN_Pos 0
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_PWR_PIN_Msk 0x000000FF

// NV_CE_CMD_PINCFG - Pin config for the CE pin (MSPI) or CMD and D0 pins (EMMC) for MRAM recovery device. For EMMC devices the FNCSELxx field is ignored and set automatically based on the EMMC module number specified.
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_CE_CMD_PINCGF_S 0
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_CE_CMD_PINCGF_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_CE_CMD_PINCGF(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_CE_CMD_PINCGF_Pos 0
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_CE_CMD_PINCGF_Msk 0xFFFFFFFF

// NV_CLK_PINCFG - The configuration to be written to the PINCFG register for the CLK pin for MRAM recovery. This applies to both MSPI and EMMC device types.  For EMMC devices the FNCSELxx field is ignored and set automatically based on the EMMC module number specified.
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_CLK_PINCGF_S 0
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_CLK_PINCGF_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_CLK_PINCGF(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_CLK_PINCGF_Pos 0
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_CLK_PINCGF_Msk 0xFFFFFFFF

// NV_DATA_PINCFG - The configuration to be written to the PINCFG register for the device's data pins. This applies to both MSPI and EMMC device types.  For EMMC devices the FNCSELxx field is ignored and set automatically based on the EMMC module number specified.
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_DATA_PINCFG_S 0
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_DATA_PINCFG_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_DATA_PINCFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_DATA_PINCFG_Pos 0
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_DATA_PINCFG_Msk 0xFFFFFFFF

// NV_DQS_PINCFG - The configuration to be written to the PINCFG register for the DQS pin in the MRAM recovery device. For EMMC devices this is not used.
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_DQS_PINCGF_S 0
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_DQS_PINCGF_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_DQS_PINCGF(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_DQS_PINCGF_Pos 0
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_DQS_PINCGF_Msk 0xFFFFFFFF

// NV_CONFIG0 - Device specific configuration used to configure the MRAM recovery NV device. For an MSPI device this value is written directly to the specified module's DEV0CFG register (Refer to the specified MSPI register for field definitions). For an EMMC device this location specifies the target clock frequency in Hz.  Note: For MSPI devices the field DEVCFG0 (in DEV0CFG) specifies which CEx (0/1) pin to use.  Only SERIALx, DUALx, QUADx and OCTALx are supported, QUAD_PAIRED, QUADPAIRED_SERIAL, and HEXx are not.
#define AM_REG_OTP_INFO0_NV_CONFIG0_CONFIG0_S 0
#define AM_REG_OTP_INFO0_NV_CONFIG0_CONFIG0_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_CONFIG0_CONFIG0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_CONFIG0_CONFIG0_Pos 0
#define AM_REG_OTP_INFO0_NV_CONFIG0_CONFIG0_Msk 0xFFFFFFFF
#define AM_ENUM_OTP_INFO0_NV_CONFIG0_CONFIG0_EMMC_CLOCK_48MHZ   0x2DC6C00  // For eMMC devices, selects a target frequency of 48MHz.

// NV_CONFIG1 - Device specific configuration used to configure the MRAM recovery NV device. For a MSPI device this value is written directly to the specified module's DEV0CFG1 register.  For an EMMC device this location specifies the UHS mode - as specified in the UHSMODESEL field in REG_SDIO0_AUTO register.  Refer to the specified MSPI and SDIO registers for the specific field definitions.
#define AM_REG_OTP_INFO0_NV_CONFIG1_CONFIG1_S 0
#define AM_REG_OTP_INFO0_NV_CONFIG1_CONFIG1_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_NV_CONFIG1_CONFIG1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_NV_CONFIG1_CONFIG1_Pos 0
#define AM_REG_OTP_INFO0_NV_CONFIG1_CONFIG1_Msk 0xFFFFFFFF
#define AM_ENUM_OTP_INFO0_NV_CONFIG1_CONFIG1_EMMC_HOST_UHS_SDR120x0  // For eMMC devices, selects the UHS mode EMMC_HOST_UHS_SDR12. This is generally the default mode.
#define AM_ENUM_OTP_INFO0_NV_CONFIG1_CONFIG1_EMMC_HOST_UHS_SDR250x1  // For eMMC devices, selects the UHS mode EMMC_HOST_UHS_SDR25.
#define AM_ENUM_OTP_INFO0_NV_CONFIG1_CONFIG1_EMMC_HOST_UHS_SDR500x2  // For eMMC devices, selects the UHS mode EMMC_HOST_UHS_SDR50.
#define AM_ENUM_OTP_INFO0_NV_CONFIG1_CONFIG1_EMMC_HOST_UHS_SDR1040x3  // For eMMC devices, selects the UHS mode EMMC_HOST_UHS_SDR104.
#define AM_ENUM_OTP_INFO0_NV_CONFIG1_CONFIG1_EMMC_HOST_UHS_DDR500x4  // For eMMC devices, selects the UHS mode EMMC_HOST_UHS_DDR50.

